package by.epam.algoritm;

/*Дана величина А, выражающая объем информации в байтах. Перевести А в более крупные единицы измерения информации.*/

public class Quest34 {
    public static void main(String[] args) {
        byte a = 120;
        short b = a;
        int c = a;
        long d = a;
        System.out.println(d);
        System.out.println(c);
    }
}
